ka2_2024/src/Catalogs/НастройкиСчетовУчетаПрочихОпераций/НастройкиСчетовУчетаПрочихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиСчетовУчетаПрочихОпераций</name>
  <comment>Настройки счетов учета прочих операций</comment>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецНастройки</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
      <types>DocumentRef.ЗаписьКнигиПокупок</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеУслугПоАренде</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</types>
      <types>DocumentRef.СписаниеОС2_4</types>
      <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.АктВыполненныхВнутреннихРабот</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ПеремещениеОС2_4</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
      <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПеремещениеНМА2_4</types>
      <types>DocumentRef.АмортизацияНМА2_4</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.СписаниеНМА2_4</types>
      <types>DocumentRef.РаспределениеВозвратныхОтходов</types>
      <types>DocumentRef.ПринятиеКУчетуОС2_4</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииОС</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
      <types>DocumentRef.ОтчетОСписанииТоваровУХранителя</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.АмортизацияОС2_4</types>
      <types>DocumentRef.ПринятиеКУчетуУзловКомпонентовАмортизации</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ДепонированиеЗарплаты</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииНМА</types>
      <types>DocumentRef.ЗаписьКнигиПродаж</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете2_5</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиМеждународногоУчета</name>
    <attributes>
      <name>ПланСчетов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/Catalogs/НастройкиСчетовУчетаПрочихОпераций/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НастройкаСчетовУчетаСервер.ДоступнаНастройкаСчетовРеглУчета() Тогда
		Элементы.ГруппаРегламентированныйУчет.Видимость = Истина;
		//++ Локализация
		УстановитьОбработчикиСобытийРегламентированногоУчета();
		УправлениеЭлементамиФормыРегламентированногоУчета(ЭтотОбъект);
		//-- Локализация
	Иначе
		Элементы.ГруппаРегламентированныйУчет.Видимость = Ложь;
		Элементы.ГруппаМеждународныйУчет.Заголовок = "";
	КонецЕсли;
	
	Если НастройкаСчетовУчетаСервер.ДоступнаНастройкаСчетовМеждународногоУчета() Тогда
		Элементы.ГруппаМеждународныйУчет.Видимость = Истина;
	Иначе
		Элементы.ГруппаМеждународныйУчет.Видимость = Ложь;
		Элементы.ГруппаРегламентированныйУчет.Заголовок = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВладелецНастройки)
		И ПравоДоступа("Чтение", Метаданные.НайтиПоТипу(ТипЗнч(Объект.ВладелецНастройки)))
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект.ВладелецНастройки, "Организация") Тогда
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВладелецНастройки, "Организация");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

//++ Локализация

&НаКлиенте
Процедура Подключаемый_СчетУчетаПриИзменении(Элемент)
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", "Субконто1", "Субконто2", "Субконто3");
	БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Объект.СчетУчета, Объект, ПоляОбъекта);
	
	ИзменитьПараметрыВыбораПолейСубконто();
	УправлениеЭлементамиФормыРегламентированногоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СубконтоПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконто();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СпособыСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

//-- Локализация

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиМеждународногоУчета

&НаКлиенте
Процедура НастройкиМеждународногоУчетаСчетУчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкиМеждународногоУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиМеждународногоУчетаСубконто1ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкиМеждународногоУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиМеждународногоУчетаСубконто2ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкиМеждународногоУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиМеждународногоУчетаСубконто3ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкиМеждународногоУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиМеждународногоУчетаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиМеждународногоУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиМеждународногоУчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

//++ Локализация

&НаКлиенте
Процедура ИзменитьПараметрыВыбораПолейСубконто()
	
	ПараметрыЗаписи = НастройкаСчетовУчетаКлиентСервер.ПараметрыВыбораСубконто(
		Организация,
		Объект,
		"Субконто" + "%Индекс%",
		"СчетУчета");
		
	НастройкаСчетовУчетаКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(
		ЭтотОбъект,
		Объект,
		"Субконто" + "%Индекс%",
		"Субконто" + "%Индекс%",
		ПараметрыЗаписи); 
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыЗаписи = НастройкаСчетовУчетаКлиентСервер.ПараметрыВыбораСубконто(
		Организация,
		Объект,
		"Субконто" + "%Индекс%",
		"СчетУчета");
	
	ОбщегоНазначенияБПКлиент.НачалоВыбораЗначенияСубконто(ЭтотОбъект, Элемент, СтандартнаяОбработка, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура УстановитьОбработчикиСобытийРегламентированногоУчета()
	
	Элементы.СчетУчета.УстановитьДействие("ПриИзменении", "Подключаемый_СчетУчетаПриИзменении");
	Элементы.Субконто1.УстановитьДействие("ПриИзменении", "Подключаемый_СубконтоПриИзменении");
	Элементы.Субконто1.УстановитьДействие("НачалоВыбора", "Подключаемый_СубконтоНачалоВыбора");
	Элементы.Субконто2.УстановитьДействие("ПриИзменении", "Подключаемый_СубконтоПриИзменении");
	Элементы.Субконто2.УстановитьДействие("НачалоВыбора", "Подключаемый_СубконтоНачалоВыбора");
	Элементы.Субконто3.УстановитьДействие("ПриИзменении", "Подключаемый_СубконтоПриИзменении");
	Элементы.Субконто3.УстановитьДействие("НачалоВыбора", "Подключаемый_СубконтоНачалоВыбора");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЭлементамиФормыРегламентированногоУчета(Форма)
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"Субконто1", "Субконто2", "Субконто3");
		
	ЗаголовкиПолей = Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконто1", "ЗаголовокСубконто2", "ЗаголовокСубконто3");
	
	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Форма.Объект.СчетУчета, Форма, ПоляФормы, ЗаголовкиПолей);
	
КонецПроцедуры

//-- Локализация



#КонецОбласти
